Repository: barnir/wishlist
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Wishlist
pt: MyWishStash

source: Profile
pt: Perfil

source: Edit Profile
pt: Editar Perfil

source: Name
pt: Nome

source: Bio
pt: Biografia

source: Phone
pt: Telemóvel

source: Save
pt: Guardar

source: Cancel
pt: Cancelar

source: Account
pt: Conta

source: Preferences
pt: Preferências

source: About
pt: Sobre

source: Actions
pt: Ações

source: Theme
pt: Tema

source: Privacy
pt: Privacidade

source: Privacy Settings
pt: Configurações de Privacidade

source: Private Profile
pt: Perfil Privado

source: Public Profile
pt: Perfil Público

# privateProfileDesc
source: Only approved users can see your wishlists
pt: Apenas utilizadores aprovados podem ver as suas wishlists

# publicProfileDesc
source: Any user can see your public wishlists
pt: Qualquer utilizador pode ver as suas wishlists públicas

source: Customize appearance
pt: Personalizar aparência

source: Help & Support
pt: Ajuda e Suporte

source: Rate App
pt: Avaliar App

source: Sign Out
pt: Terminar Sessão

source: Delete Account
pt: Apagar Conta

# deleteAccountDesc
source: This action is irreversible
pt: Esta ação é irreversível

source: Favorites
pt: Favoritos

source: Shared
pt: Partilhadas

source: Add bio...
pt: Adicionar biografia...

# tellAboutYou
source: Tell a bit about yourself...
pt: Conte um pouco sobre si...

source: No name
pt: Sem nome

source: No email
pt: Sem email

source: No email linked
pt: Nenhum email vinculado

source: User not found.
pt: Utilizador não encontrado.

source: Name cannot be empty
pt: Nome não pode estar vazio

# errorSaving
source: Error saving: {error}
pt: Erro ao guardar: {error}

# deleteAccountConfirmation
source: Delete Account
pt: Apagar Conta

# deleteAccountWarning
source: This action is irreversible. All your data will be lost. To confirm, type "DELETE" in the box below.
pt: Esta ação é irreversível. Todos os seus dados serão perdidos. Para confirmar, escreva "APAGAR" na caixa abaixo.

source: Confirm
pt: Confirmar

source: Delete Permanently
pt: Apagar Permanentemente

source: Account deleted successfully.
pt: Conta apagada com sucesso.

# errorDeletingAccount
source: Error deleting account: {error}
pt: Erro ao apagar conta: {error}

source: Login
pt: Entrar

source: Register
pt: Registar

source: Welcome
pt: Bem-vindo

source: My Wishlists
pt: As Minhas Listas

source: Explore
pt: Explorar

source: Create Wishlist
pt: Criar Lista

source: Wishlist Name
pt: Nome da Lista

source: Description
pt: Descrição

source: Public
pt: Público

source: Private
pt: Privado

# deleteConfirmWord
source: DELETE
pt: APAGAR

# errorLoadingWishlists
source: Error loading wishlists: {error}
pt: Erro ao carregar wishlists: {error}

# noWishlistsYetTitle
source: No wishlists yet
pt: Nenhuma wishlist por aqui

# noWishlistsYetSubtitle
source: Tap "+" to create your first!
pt: Toque em "+" para criar a sua primeira!

# pleaseLoginToSeeWishlists
source: Please log in to see your wishlists.
pt: Por favor, faça login para ver suas wishlists.

source: Loading wishlists...
pt: A carregar wishlists...

# addNewWishlistTooltip
source: Add new wishlist
pt: Adicionar nova wishlist

# publicWishlistsTab
source: Public Wishlists
pt: Wishlists Públicas

# aboutTab
source: About
pt: Sobre

# noPublicWishlists
source: No public wishlist
pt: Nenhuma wishlist pública

# noPublicWishlistsSubtitle
source: This user doesn't have public wishlists yet.
pt: Este utilizador ainda não tem wishlists públicas.

# publicLabel
source: Public
pt: Pública

# privateLabel
source: Private
pt: Privada

# favoritesTitle
source: Favorites
pt: Favoritos

source: Loading favorites...
pt: A carregar favoritos...

source: No favorites yet
pt: Nenhum favorito ainda

# favoritesEmptySubtitle
source: Explore profiles and mark favorites to see their public wishlists!
pt: Explora perfis e marca os teus utilizadores favoritos para veres as suas wishlists públicas!

# searchProfilesTooltip
source: Search profiles
pt: Explorar perfis

# exploreTitle
source: Explore
pt: Explorar

# searchUsersPlaceholder
source: Search users...
pt: Pesquisar utilizadores...

# searchUsersTitle
source: Search users
pt: Pesquisar utilizadores

# searchUsersSubtitle
source: Type a name or email to find users and their public wishlists.
pt: Digite um nome ou email para encontrar utilizadores e as suas wishlists públicas.

source: Searching...
pt: A pesquisar...

source: No results
pt: Nenhum resultado

# noResultsSubtitle
source: No users found for that term.
pt: Não foram encontrados utilizadores com esse termo.

source: Loading more...
pt: A carregar mais...

source: Loading more wishlists...
pt: A carregar mais wishlists...

source: Loading more favorites...
pt: A carregar mais favoritos...

source: Loading more results...
pt: A carregar mais resultados...

source: Loading wishlist...
pt: A carregar wishlist...

source: Loading items...
pt: A carregar itens...

source: Loading more items...
pt: A carregar mais itens...

# wishlistIsPrivate
source: This wishlist is private
pt: Esta wishlist é privada

# wishlistIsPublic
source: This wishlist is public
pt: Esta wishlist é pública

source: Remove from favorites
pt: Remover dos favoritos

source: Add to favorites
pt: Adicionar aos favoritos

# noWishlistFoundCreateNew
source: No wishlist found. Create a new one.
pt: Nenhuma wishlist encontrada. Crie uma nova.

source: Private Wishlist
pt: Wishlist Privada

# errorLoadingFavorites
source: Error loading favorites: {error}
pt: Erro ao carregar favoritos: {error}

# errorLoadingResults
source: Error loading results: {error}
pt: Erro ao carregar resultados: {error}

# createWishlistTitle
source: Create Wishlist
pt: Criar Wishlist

# editWishlistTitle
source: Edit Wishlist
pt: Editar Wishlist

# wishlistDetailsSection
source: Wishlist Details
pt: Detalhes da Wishlist

# wishlistImageSection
source: Wishlist Image
pt: Imagem da Wishlist

# errorSavingWishlist
source: Error saving wishlist: {error}
pt: Erro ao salvar wishlist: {error}

# wishlistEmptyTitle
source: Your wishlist is empty
pt: A sua wishlist está vazia

# wishlistEmptySubtitle
source: Tap the + button to add your first item.
pt: Toque no botão + para adicionar o primeiro item.

# addNewItemTooltip
source: Add new item
pt: Adicionar novo item

# favoriteBadge
source: FAVORITE
pt: FAVORITO

# errorPrefix
source: Error: {error}
pt: Erro: {error}

# publicProfileBadge
source: Public profile
pt: Perfil público

# privateProfileBadge
source: Private profile
pt: Perfil privado

# filterAndSortTooltip
source: Filter & Sort
pt: Filtrar e ordenar

source: Edit
pt: Editar

source: Delete
pt: Eliminar

source: View
pt: Ver

source: Could not open link
pt: Não foi possível abrir o link

# deleteItemTooltip
source: Delete item
pt: Eliminar item

# deleteItemTitle
source: Delete item
pt: Eliminar item

# deleteItemConfirmation
source: Are you sure you want to delete "{itemName}"?
pt: Tens a certeza que queres eliminar "{itemName}"?

source: Tap to add
pt: Toca para adicionar

# processingImage
source: Processing...
pt: A processar...

# recommendedImageSize
source: Recommended: 400x400px or higher
pt: Recomendado: 400x400px ou superior

# wishlistNameLabel
source: Wishlist Name
pt: Nome da Wishlist

# wishlistNameHint
source: Enter your wishlist name
pt: Digite o nome da sua wishlist

# wishlistNameRequired
source: Wishlist name is required
pt: Nome da wishlist é obrigatório

# privacySectionTitle
source: Privacy
pt: Privacidade

# privateWishlistSubtitle
source: Only you can see this wishlist
pt: Apenas tu podes ver esta wishlist

# publicWishlistSubtitle
source: Other users can see this wishlist
pt: Outros utilizadores podem ver esta wishlist

source: Save Changes
pt: Guardar Alterações

source: Added to favorites!
pt: Adicionado aos favoritos!

source: Removed from favorites
pt: Removido dos favoritos

# contactSuggestionsTitle
source: Contact Suggestions
pt: Sugestões dos Contactos

source: Loading suggestions...
pt: A carregar sugestões...

# noSuggestionsTitle
source: No suggestions
pt: Nenhuma sugestão

# noSuggestionsSubtitle
source: No app users were found in your contacts.
pt: Não foram encontrados utilizadores da app nos seus contactos.

# contactsAccessTitle
source: Contacts Access
pt: Acesso aos Contactos

# contactsAccessExplanation
source: To find friends from your contacts who already use the app, we need access to your contacts list.
pt: Para encontrar amigos dos seus contactos que já usam a app, precisamos de acesso à sua lista de contactos.

# grantContactsAccess
source: Allow Contacts Access
pt: Permitir Acesso aos Contactos

source: View profile
pt: Ver perfil

# profileNotFoundTitle
source: Profile not found
pt: Perfil não encontrado

# profileNotFoundSubtitle
source: This user may have been removed.
pt: Este utilizador pode ter sido removido.

# shareProfileTooltip
source: Share profile
pt: Partilhar perfil

# profileInfoSectionTitle
source: Profile Information
pt: Informações do Perfil

# memberSinceLabel
source: Member since
pt: Membro desde

# recentlyLabel
source: Recently
pt: Recentemente

# otpVerifyTitle
source: Verify Code
pt: Verificar Código

# otpInstructionPhone
source: Enter the 6-digit code sent to {phone}.
pt: Insira o código de 6 dígitos enviado para {phone}.

# otpAutoDetectNote
source: Firebase will automatically detect the SMS.
pt: O Firebase irá detectar automaticamente o SMS.

# otpInvalidCode
source: Invalid code. Try again.
pt: Código inválido. Tente novamente.

# otpCodeExpired
source: Code expired. Resend the code.
pt: Código expirou. Reenvie o código.

# otpPhoneInUse
source: Phone already linked to another account.
pt: Telefone já associado a outra conta.

# otpInternalError
source: Internal error. Try again.
pt: Erro interno. Tente novamente.

# otpCodeResent
source: Code resent.
pt: Código reenviado.

# otpResend
source: Resend Code
pt: Reenviar Código

# otpResendIn
source: Resend in {seconds}s
pt: Reenviar em {seconds} s

# otpVerifyButton
source: Verify
pt: Verificar

# shareProfileMessage
source: Check my profile on Wishlist App: {link}
pt: Vê o meu perfil no Wishlist App: {link}

# errorLoadingProfile
source: Error loading profile: {error}
pt: Erro ao carregar perfil: {error}

source: Language Settings
pt: Configurações de Idioma

source: Automatic
pt: Automático

# systemLanguage
source: Follow system language
pt: Seguir idioma do sistema

source: Language
pt: Idioma

# themeSettings
source: App Theme
pt: Tema da App

# themeLight
source: Light Theme
pt: Tema Claro

# themeLightSubtitle
source: Always use the light theme
pt: Usar sempre o tema claro

# themeDark
source: Dark Theme
pt: Tema Escuro

# themeDarkSubtitle
source: Always use the dark theme
pt: Usar sempre o tema escuro

# themeSystem
source: Automatic
pt: Automático

# themeSystemSubtitle
source: Follow system setting
pt: Seguir as definições do sistema

source: Close
pt: Fechar

# registerTitle
source: Register new account
pt: Registar nova conta

# registerErrorPrefix
source: Registration error:
pt: Erro ao registar:

# registerSystemError
source: System error. Please try again.
pt: Erro no sistema. Por favor tente novamente.

# registerEmailInUse
source: This email is already in use. Try logging in.
pt: Este email já está em uso. Tente fazer login.

# registerWeakPassword
source: Password is too weak. Choose a stronger password.
pt: A password é muito fraca. Escolha uma password mais forte.

# registerInvalidEmail
source: Invalid email. Check the format.
pt: Email inválido. Verifique o formato.

# registerEmailRequired
source: Email required
pt: Email obrigatório

# registerEmailInvalidFormat
source: Invalid email format
pt: Formato de email inválido

# registerNameRequired
source: Name required
pt: Nome obrigatório

# registerNameTooShort
source: Name too short
pt: Nome demasiado curto

# registerPasswordsDoNotMatch
source: Passwords do not match
pt: Passwords não coincidem

# confirmPasswordLabel
source: Confirm Password
pt: Confirmar Password

# registerPasswordRequirementsTitle
source: Password requirements:
pt: Requisitos da password:

# registerAction
source: Register
pt: Registar

# registerExistingAccountCta
source: Already have an account? Log in!
pt: Já tens conta? Fazer login!

# scrapingExtractingInfo
source: Extracting product information...
pt: Extraindo informações do produto...

# scrapingFillingFields
source: Filling fields automatically...
pt: Preenchendo campos automaticamente...

# scrapingLoadingImage
source: Loading product image...
pt: Carregando imagem do produto...

# scrapingExtractedPrefix
source: Extracted: {features}. Review the data!
pt: Extraído: {features}. Verifique os dados!

# scrapingCompletedAdjust
source: Done! Review and adjust the data if needed.
pt: Concluído! Verifique e ajuste os dados se necessário.

# scrapingError
source: Error extracting data. Fill manually.
pt: Erro ao extrair dados. Preencha manualmente.

# scrapingFeatureTitle
source: title
pt: título

# scrapingFeaturePrice
source: price
pt: preço

# scrapingFeatureDescription
source: description
pt: descrição

# scrapingFeatureCategory
source: category
pt: categoria

# scrapingFeatureRating
source: rating
pt: avaliação

# scrapingFeatureImage
source: image
pt: imagem

# addItemTitle
source: Add Item
pt: Adicionar Item

# editItemTitle
source: Edit Item
pt: Editar Item

# chooseWishlistLabel
source: Choose a Wishlist
pt: Escolha uma Wishlist

# chooseWishlistValidation
source: Please choose a wishlist
pt: Por favor, escolha uma wishlist

# newWishlistNameLabel
source: New wishlist name
pt: Nome da nova wishlist

# newWishlistNameRequired
source: Enter a name for the wishlist
pt: Insira um nome para a wishlist

# createWishlistAction
source: Create Wishlist
pt: Criar Wishlist

# itemNameLabel
source: Item Name
pt: Nome do Item

# itemNameRequired
source: Item name is required
pt: Nome do item é obrigatório

# categoryLabel
source: Category
pt: Categoria

# itemDescriptionLabel
source: Description
pt: Descrição

# quantityLabel
source: Quantity
pt: Quantidade

# quantityRequired
source: Enter the quantity
pt: Insere a quantidade

# quantityInvalid
source: Invalid quantity
pt: Quantidade inválida

# priceLabel
source: Price
pt: Preço

# priceInvalid
source: Invalid price
pt: Preço inválido

# selectOrCreateWishlistPrompt
source: Please select or create a wishlist.
pt: Por favor, selecione ou crie uma wishlist.

# errorCreatingWishlist
source: Error creating wishlist: {error}
pt: Erro ao criar wishlist: {error}

# errorLoadingItem
source: Error loading item: {error}
pt: Erro ao carregar item: {error}

# imageUploadFailed
source: Image upload failed: {error}
pt: Falha upload imagem: {error}

# addItemAction
source: Add
pt: Adicionar

# saveItemAction
source: Save
pt: Guardar

# emailRequired
source: Email is required
pt: Email é obrigatório

# emailInvalid
source: Invalid email
pt: Email inválido

source: Email too long
pt: Email demasiado longo

# emailDomainInvalid
source: Invalid email domain
pt: Domínio do email inválido

# passwordRequired
source: Password is required
pt: Password é obrigatória

# passwordTooShort
source: Password must be at least 8 characters
pt: Password deve ter pelo menos 8 caracteres

source: Password too long
pt: Password demasiado longa

# passwordNeedUpper
source: Password must contain at least one uppercase letter
pt: Password deve conter pelo menos uma letra maiúscula

# passwordNeedLower
source: Password must contain at least one lowercase letter
pt: Password deve conter pelo menos uma letra minúscula

# passwordNeedNumber
source: Password must contain at least one number
pt: Password deve conter pelo menos um número

# passwordNeedSpecial
source: Password must contain at least one special character
pt: Password deve conter pelo menos um caracter especial

# nameRequired
source: Name is required
pt: Nome é obrigatório

# nameTooShort
source: Name must be at least 2 characters
pt: Nome deve ter pelo menos 2 caracteres

source: Name too long
pt: Nome demasiado longo

# nameInvalidChars
source: Name contains invalid characters
pt: Nome contém caracteres inválidos

# phoneRequired
source: Phone number is required
pt: Número de telefone é obrigatório

# phoneInvalidFormat
source: Invalid phone number (format: 9XXXXXXXX)
pt: Número de telefone inválido (formato: 9XXXXXXXX)

# urlMustBeHttp
source: URL must use HTTP or HTTPS
pt: URL deve usar HTTP ou HTTPS

# urlInvalid
source: Invalid URL
pt: URL inválido

# urlLocalNotAllowed
source: Local URLs are not allowed
pt: URLs locais não são permitidos

source: URL too long
pt: URL demasiado longo

# priceNegative
source: Price cannot be negative
pt: Preço não pode ser negativo

source: Price too high
pt: Preço demasiado alto

# descriptionTooLong
source: Description too long (max 500 characters)
pt: Descrição demasiado longa (máximo 500 caracteres)

# wishlistNameTooShort
source: Wishlist name must be at least 2 characters
pt: Nome da wishlist deve ter pelo menos 2 caracteres

source: Wishlist name too long
pt: Nome da wishlist demasiado longo

# itemNameTooShort
source: Item name must be at least 2 characters
pt: Nome do item deve ter pelo menos 2 caracteres

source: Item name too long
pt: Nome do item demasiado longo

# imageTooLarge
source: Image too large (max 10MB)
pt: Imagem demasiado grande (máximo 10MB)

# imageFormatUnsupported
source: Unsupported image format (use JPG, PNG or GIF)
pt: Formato de imagem não suportado (use JPG, PNG ou GIF)

# otpCodeRequired
source: Code is required
pt: Código é obrigatório

# otpCodeLength
source: Code must be 6 digits
pt: Código deve ter 6 dígitos

# otpCodeDigitsOnly
source: Code must contain only numbers
pt: Código deve conter apenas números

# languageSubtitlePtPt
source: European Portuguese
pt: Português de Portugal

# languageSubtitleInternational
source: International
pt: Internacional

# searchTab
source: Search
pt: Pesquisar

# friendsTab
source: Friends
pt: Amigos

# inviteTab
source: Invite
pt: Convidar

source: Discover Friends
pt: Descobrir Amigos

source: Allow Contacts Access
pt: Permitir Acesso aos Contactos

# contactsPermissionDescription
source: Allow access to contacts to discover which of your friends already use the app
pt: Permite acesso aos contactos para descobrir quais dos teus amigos já usam a app

source: Discovering friends...
pt: A descobrir amigos...

source: Loading contacts...
pt: A carregar contactos...

source: No friends found
pt: Nenhum amigo encontrado

# noFriendsFoundDescription
source: Your contacts who use the app will appear here
pt: Os teus contactos que usam a app aparecerão aqui

# allFriendsUseApp
source: All your contacts already use the app!
pt: Todos os teus contactos já usam a app!

# noContactsToInvite
source: Or you have no contacts to invite
pt: Ou não tens contactos para convidar

# friendBadge
source: Friend
pt: Amigo

# contactLabel
source: Contact
pt: Contacto

# inviteButton
source: Invite
pt: Convidar

# inviteSubject
source: Invitation to WishlistApp
pt: Convite para WishlistApp

# invitePlayStoreMessage
source: ðŸ“± Coming soon to Play Store!
pt: 📱 Brevemente na Play Store!

# contactsPermissionRequired
source: Contacts permission required to discover friends
pt: Permissão de contactos necessária para descobrir amigos

# errorRequestingPermission
source: Error requesting permission: {error}
pt: Erro ao solicitar permissão: {error}

# errorLoadingContacts
source: Error loading contacts: {error}
pt: Erro ao carregar contactos: {error}

# errorSendingInvite
source: Error sending invite: {error}
pt: Erro ao enviar convite: {error}

# notificationsTitle
source: Notifications
pt: Notificações

source: Notifications Active
pt: Notificações Ativas

source: Notifications Disabled
pt: Notificações Desativadas

source: Notifications enabled
pt: Notificações ativadas

# notificationsDisabledGoSettings
source: Notifications disabled - enable in settings
pt: Notificações desativadas - ativar nas configurações

# notificationsNotRequested
source: Notification permission not requested
pt: Permissão de notificações não solicitada

# notificationsSilent
source: Silent notifications enabled
pt: Notificações silenciosas ativadas

# notificationsSuccess
source: Notifications activated successfully!
pt: Notificações ativadas com sucesso!

# notificationsSilentSuccess
source: Silent notifications activated!
pt: Notificações silenciosas ativadas!

# notificationsDenied
source: Notifications denied. You can enable them in settings.
pt: Notificações negadas. Pode ativar nas configurações.

# notificationsNotDetermined
source: Permission not determined. Try again?
pt: Permissão não determinada. Tentar novamente?

# notificationsError
source: Error requesting notification permissions
pt: Erro ao solicitar permissões de notificação

# notificationsActivate
source: Enable Notifications
pt: Ativar Notificações

# notificationsRequesting
source: Requesting...
pt: A solicitar...

# notificationsGoSettings
source: Go to Settings
pt: Ir para Configurações

# notificationsTryAgain
source: Try again
pt: Tentar novamente

# notificationsReceiveAlerts
source: Receive alerts about:
pt: Receba alertas sobre:

# notificationsBenefitPriceDrops
source: Price drops on your items
pt: Baixas de preço nos seus itens

# notificationsBenefitShares
source: New list shares
pt: Novas partilhas de listas

# notificationsBenefitFavorites
source: New favorites
pt: Novos favoritos

# notificationsBenefitGiftHints
source: Gift hints
pt: Dicas de presentes

# notificationsSettingsInstructions
source: Go to Settings > Apps > WishlistApp > Notifications to enable manually
pt: Vai às Configurações > Apps > WishlistApp > Notificações para ativar manualmente
